InformationRegisters/Лео_ОчередьПочтовогоОповещенияПриИзменениОбъекта/Лео_ОчередьПочтовогоОповещенияПриИзменениОбъекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лео_ОчередьПочтовогоОповещенияПриИзменениОбъекта</name>
  <resources>
    <name>ПараметрОтслеживания1</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПараметрОтслеживания2</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПараметрОтслеживания3</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПараметрОтслеживания4</name>
    <type>
      <types>EnumRef.абс_СтатусыКонтрагентов</types>
      <types>EnumRef.абс_СтатусыЗаявокНаТранспорт</types>
      <types>Boolean</types>
      <types>EnumRef.абс_СтатусыПолученныхДокументов</types>
      <types>String</types>
      <types>Number</types>
      <types>EnumRef.абс_СтатусыОтгрузки</types>
      <types>EnumRef.абс_СтатусыДЗПоЗаказам</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПараметрОтслеживания5</name>
    <type>
      <types>EnumRef.абс_СтатусыКонтрагентов</types>
      <types>EnumRef.абс_СтатусыЗаявокНаТранспорт</types>
      <types>Boolean</types>
      <types>EnumRef.абс_СтатусыПолученныхДокументов</types>
      <types>String</types>
      <types>Number</types>
      <types>EnumRef.абс_СтатусыОтгрузки</types>
      <types>EnumRef.абс_СтатусыДЗПоЗаказам</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОтправкиОповещения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияОбъекта</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопАдресОповещения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемаСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОповещениеОтправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОповещения</name>
    <type>
      <types>EnumRef.абс_ТипыОповещений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

InformationRegisters/абс_НастройкиОповещения/абс_НастройкиОповещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_НастройкиОповещения</name>
  <resources>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипОповещения</name>
    <type>
      <types>EnumRef.абс_ТипыОповещений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

InformationRegisters/Лео_ИсторияРеквизитаЧислоДнейЗадолженности/Лео_ИсторияРеквизитаЧислоДнейЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лео_ИсторияРеквизитаЧислоДнейЗадолженности</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Предоплата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧислоДнейПредоплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопустимоеЧислоДнейЗадолженности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

InformationRegisters/абс_КонтрольДЗПоЗаказам/абс_КонтрольДЗПоЗаказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_КонтрольДЗПоЗаказам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СтатусДЗ</name>
    <type>
      <types>EnumRef.абс_СтатусыДЗПоЗаказам</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПринудительнаяБлокировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредоплатныйЗаказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Enums/абс_ТипыОповещений/абс_ТипыОповещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ТипыОповещений</name>
  <enumValues>
    <name>ОкончаниеДействияСертификатов</name>
  </enumValues>
  <enumValues>
    <name>РассылкаПоСтоплисту</name>
  </enumValues>
  <enumValues>
    <name>РассылкаБлокировкиЗаказа</name>
  </enumValues>
  <enumValues>
    <name>РассылкаИзменениеЗаказа</name>
  </enumValues>
  <enumValues>
    <name>РассылкаНеотгруженныйТовар</name>
  </enumValues>
  <enumValues>
    <name>РассылкаОтчетаПоЗапасам</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСпецификацийИТехкарт</name>
  </enumValues>
</mdclass:Enum>

Enums/абс_ВидыСпособовДоставки/абс_ВидыСпособовДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыСпособовДоставки</name>
  <enumValues>
    <name>Самовывоз</name>
  </enumValues>
  <enumValues>
    <name>ДоставкаДоТК</name>
  </enumValues>
  <enumValues>
    <name>ДоставкаДоТККлиента</name>
  </enumValues>
  <enumValues>
    <name>ДоставкаДоДвери</name>
  </enumValues>
  <enumValues>
    <name>Перегруз</name>
  </enumValues>
</mdclass:Enum>

Enums/абс_СтатусыДЗПоЗаказам/абс_СтатусыДЗПоЗаказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыДЗПоЗаказам</name>
  <enumValues>
    <name>Блокирован</name>
  </enumValues>
  <enumValues>
    <name>Разблокирован</name>
  </enumValues>
</mdclass:Enum>

Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <predefined>
    <items>
      <name>EmailОрганизации</name>
      <description>Email организации</description>
    </items>
    <items>
      <name>EmailФизЛица</name>
      <description>Email физ. лица</description>
    </items>
    <items>
      <name>ИнформАдресФизЛица</name>
      <description>Адрес для информирования физ. лица</description>
    </items>
    <items>
      <name>АдресДоставкиКонтрагента</name>
      <description>Адрес доставки</description>
    </items>
    <items>
      <name>ЮрАдресФизЛица</name>
      <description>Адрес по прописке физ. лица</description>
    </items>
    <items>
      <name>ФактАдресФизЛица</name>
      <description>Адрес проживания физ. лица</description>
    </items>
    <items>
      <name>ИнострАдресФизЛица</name>
      <description>Адрес физ. лица за пределами РФ </description>
    </items>
    <items>
      <name>АдресЭлектроннойПочтыКонтактногоЛицаКонтрагента</name>
      <description>Адрес электронной почты контактного лица контрагента</description>
    </items>
    <items>
      <name>АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами</name>
      <description>Адрес электронной почты контрагента для обмена электронными документами</description>
    </items>
    <items>
      <name>КонтактнТелефонКандидата</name>
      <description>Контактн телефон кандидата</description>
    </items>
    <items>
      <name>абс_МестоДоставки</name>
      <description>Место доставки</description>
    </items>
    <items>
      <name>МобильныйТелефонКонтактногоЛицаКонтрагента</name>
      <description>Мобильный телефон контактного лица контрагента</description>
    </items>
    <items>
      <name>АдресОрганизацииПочтовый</name>
      <description>Почтовый адрес организации</description>
    </items>
    <items>
      <name>РабочийТелефонКонтактногоЛицаКонтрагента</name>
      <description>Рабочий телефон контактного лица контрагента</description>
    </items>
    <items>
      <name>СлужебныйАдресЭлектроннойПочтыПользователя</name>
      <description>Служебный адрес электронной почты пользователя</description>
    </items>
    <items>
      <name>ТелефонКонтрагента</name>
      <description>Телефон контрагента</description>
    </items>
    <items>
      <name>ТелефонОрганизации</name>
      <description>Телефон организации</description>
    </items>
    <items>
      <name>ТелефонПоЮрАдресуОрганизации</name>
      <description>Телефон по юридическому адресу организации</description>
    </items>
    <items>
      <name>ТелефонФизЛица</name>
      <description>Телефон физ.лица домашний</description>
    </items>
    <items>
      <name>ТелефонСлужебный</name>
      <description>Телефон физ.лица служебный</description>
    </items>
    <items>
      <name>АдресИнострОрганизацииУчред</name>
      <description>Учредительный адрес иностранной организации</description>
    </items>
    <items>
      <name>ФаксКонтрагента</name>
      <description>Факс контрагента</description>
    </items>
    <items>
      <name>ФаксОрганизации</name>
      <description>Факс организации</description>
    </items>
    <items>
      <name>ФактАдресКонтрагента</name>
      <description>Фактический адрес контрагента</description>
    </items>
    <items>
      <name>ФактАдресОрганизации</name>
      <description>Фактический адрес организации</description>
    </items>
    <items>
      <name>ЮрАдресКонтрагента</name>
      <description>Юридический адрес контрагента</description>
    </items>
    <items>
      <name>ЮрАдресОрганизации</name>
      <description>Юридический адрес организации</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбъектаКонтактнойИнформации</name>
    <type>
      <types>EnumRef.ВидыОбъектовКонтактнойИнформации</types>
    </type>
  </attributes>
</mdclass:Catalog>

Catalogs/Регионы/Регионы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Регионы</name>
  <comment>Бизнес-регионы</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодРегиона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодАдресногоЭлемента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖДСтанцияНазначения</name>
    <comment>Железнодорожная станция назначения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Регион</name>
    <type>
      <types>CatalogRef.абс_Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Город</name>
    <type>
      <types>CatalogRef.абс_Города</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЦентрРегиона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипБизнесРегиона</name>
    <type>
      <types>EnumRef.абс_ТипыБизнесРегионов</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
</mdclass:Catalog>

Catalogs/Лео_РабочиеКаталоги/Лео_РабочиеКаталоги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Лео_РабочиеКаталоги</name>
  <predefined>
    <items>
      <name>КаталогЛогированияРассылкиОтчетаПДЗ</name>
      <description>Каталог логирования ПДЗ</description>
    </items>
  </predefined>
  <attributes>
    <name>Каталог</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

CommonModules/лео_ОбработкаОповещения/Module.bsl
//Сафонов ЕА
//Проверяет изменился ли заказ по параметрам отслеживания, если изменения были создает движение по регистру.
//ПараметрОтслеживания1 Количество товара по ТЧ Товары
//ПараметрОтслеживания2 Количество товара по ТЧ Неотгруженно
//ПараметрОтслеживания3 Сумма по ТЧ Неотгруженно
Процедура ЗаказПокупателяДвижениеПоРегиструЛео_ОчередьПочтовогоОповещенияПриИзменениОбъекта (СсылкаЗаказ,ВремяИзмерения)Экспорт
	
	
	ОчерьдьОповещения = РегистрыСведений.Лео_ОчередьПочтовогоОповещенияПриИзменениОбъекта.СоздатьМенеджерЗаписи();
	ОчерьдьОповещения.Объект = СсылкаЗаказ;
	ОчерьдьОповещения.ОповещениеОтправлено = Ложь;
	ОчерьдьОповещения.ТипОповещения = Перечисления.абс_ТипыОповещений.РассылкаИзменениеЗаказа;
	ОчерьдьОповещения.Прочитать();
	
	Если не ОчерьдьОповещения.Выбран()Тогда
		ОчерьдьОповещенияНеОбработана = РегистрыСведений.Лео_ОчередьПочтовогоОповещенияПриИзменениОбъекта.СоздатьМенеджерЗаписи();
		ОчерьдьОповещенияНеОбработана.Объект = СсылкаЗаказ;
		ОчерьдьОповещенияНеОбработана.ТипОповещения = Перечисления.абс_ТипыОповещений.РассылкаИзменениеЗаказа;
		ОчерьдьОповещенияНеОбработана.ОповещениеОтправлено = Истина;
		ОчерьдьОповещенияНеОбработана.Прочитать();

		
		Если не ОчерьдьОповещенияНеОбработана.Выбран()Тогда
			ОчерьдьОповещенияНеОбработана.Объект = СсылкаЗаказ;
			ОчерьдьОповещенияНеОбработана.ТипОповещения = Перечисления.абс_ТипыОповещений.РассылкаИзменениеЗаказа;
			ОчерьдьОповещенияНеОбработана.ОповещениеОтправлено = Ложь;
			ОчерьдьОповещенияНеОбработана.ПараметрОтслеживания1 = СсылкаЗаказ.Товары.Итог("Количество");
			ОчерьдьОповещенияНеОбработана.ПараметрОтслеживания2 = СсылкаЗаказ.абс_Неотгружено.Итог("Количество");
			ОчерьдьОповещенияНеОбработана.ПараметрОтслеживания3 = СсылкаЗаказ.Товары.Итог("Сумма");
			ОчерьдьОповещенияНеОбработана.ДатаИзмененияОбъекта = ТекущаяДата() ;
			ОчерьдьОповещенияНеОбработана.Записать();
		Иначе
			Если ОчерьдьОповещенияНеОбработана.ПараметрОтслеживания1 <> СсылкаЗаказ.Товары.Итог("Количество")Или
			 ОчерьдьОповещенияНеОбработана.ПараметрОтслеживания2 <> СсылкаЗаказ.абс_Неотгружено.Итог("Количество")Или
			 ОчерьдьОповещенияНеОбработана.ПараметрОтслеживания3 <> СсылкаЗаказ.Товары.Итог("Сумма")Тогда

				ОчерьдьОповещения.Объект = СсылкаЗаказ;
				ОчерьдьОповещения.ТипОповещения = Перечисления.абс_ТипыОповещений.РассылкаИзменениеЗаказа;
				ОчерьдьОповещения.ОповещениеОтправлено = Ложь;
				ОчерьдьОповещения.ПараметрОтслеживания1 = СсылкаЗаказ.Товары.Итог("Количество");
				ОчерьдьОповещения.ПараметрОтслеживания2 = СсылкаЗаказ.абс_Неотгружено.Итог("Количество");
				ОчерьдьОповещения.ПараметрОтслеживания3 = СсылкаЗаказ.Товары.Итог("Сумма");
				ОчерьдьОповещения.ДатаИзмененияОбъекта = ТекущаяДата() ;
				ОчерьдьОповещения.Записать();
			КонецЕсли;
		КонецЕсли;

	Иначе
		Если ОчерьдьОповещения.ПараметрОтслеживания1 <> СсылкаЗаказ.Товары.Итог("Количество")Или
			 ОчерьдьОповещения.ПараметрОтслеживания2 <> СсылкаЗаказ.абс_Неотгружено.Итог("Количество")Или
			 ОчерьдьОповещения.ПараметрОтслеживания3 <> СсылкаЗаказ.Товары.Итог("Сумма")Тогда

				ОчерьдьОповещения.Объект = СсылкаЗаказ;
				ОчерьдьОповещения.ТипОповещения = Перечисления.абс_ТипыОповещений.РассылкаИзменениеЗаказа;
				ОчерьдьОповещения.ОповещениеОтправлено = Ложь;
				ОчерьдьОповещения.ПараметрОтслеживания1 = СсылкаЗаказ.Товары.Итог("Количество");
				ОчерьдьОповещения.ПараметрОтслеживания2 = СсылкаЗаказ.абс_Неотгружено.Итог("Количество");
				ОчерьдьОповещения.ПараметрОтслеживания3 = СсылкаЗаказ.Товары.Итог("Сумма");
				ОчерьдьОповещения.ДатаИзмененияОбъекта = ТекущаяДата() ;
				ОчерьдьОповещения.Записать();
		КонецЕсли;
	КонецЕсли	
	
		
КонецПроцедуры

Процедура ЗаказПокупателяДвижениеПоРегиструЛео_ОчередьПочтовогоОповещенияПриПереносеВНеотгружено (СсылкаЗаказ,ВремяИзмерения)Экспорт
	
	
	ОчерьдьОповещения = РегистрыСведений.Лео_ОчередьПочтовогоОповещенияПриИзменениОбъекта.СоздатьМенеджерЗаписи();
	ОчерьдьОповещения.Объект = СсылкаЗаказ;
	ОчерьдьОповещения.ОповещениеОтправлено = Ложь;
	ОчерьдьОповещения.ТипОповещения = Перечисления.абс_ТипыОповещений.РассылкаНеотгруженныйТовар;
	ОчерьдьОповещения.Прочитать();
	
	Если не ОчерьдьОповещения.Выбран()Тогда
		ОчерьдьОповещенияНеОбработана = РегистрыСведений.Лео_ОчередьПочтовогоОповещенияПриИзменениОбъекта.СоздатьМенеджерЗаписи();
		ОчерьдьОповещенияНеОбработана.Объект = СсылкаЗаказ;
		ОчерьдьОповещенияНеОбработана.ТипОповещения = Перечисления.абс_ТипыОповещений.РассылкаНеотгруженныйТовар;
		ОчерьдьОповещенияНеОбработана.ОповещениеОтправлено = Истина;
		ОчерьдьОповещенияНеОбработана.Прочитать();

		
		Если не ОчерьдьОповещенияНеОбработана.Выбран()Тогда
			ОчерьдьОповещенияНеОбработана.Объект = СсылкаЗаказ;
			ОчерьдьОповещенияНеОбработана.ТипОповещения = Перечисления.абс_ТипыОповещений.РассылкаНеотгруженныйТовар;
			ОчерьдьОповещенияНеОбработана.ОповещениеОтправлено = Ложь;
			ОчерьдьОповещенияНеОбработана.ПараметрОтслеживания1 = СсылкаЗаказ.Товары.Итог("Количество");
			ОчерьдьОповещенияНеОбработана.ПараметрОтслеживания2 = СсылкаЗаказ.абс_Неотгружено.Итог("Количество");
			ОчерьдьОповещенияНеОбработана.ПараметрОтслеживания3 = СсылкаЗаказ.Товары.Итог("Сумма");
			ОчерьдьОповещенияНеОбработана.ДатаИзмененияОбъекта = ТекущаяДата() ;
			ОчерьдьОповещенияНеОбработана.Записать();
		Иначе
			Если  ОчерьдьОповещенияНеОбработана.ПараметрОтслеживания2 <> СсылкаЗаказ.абс_Неотгружено.Итог("Количество")Тогда

				ОчерьдьОповещения.Объект = СсылкаЗаказ;
				ОчерьдьОповещения.ТипОповещения = Перечисления.абс_ТипыОповещений.РассылкаНеотгруженныйТовар;
				ОчерьдьОповещения.ОповещениеОтправлено = Ложь;
				ОчерьдьОповещения.ПараметрОтслеживания1 = СсылкаЗаказ.Товары.Итог("Количество");
				ОчерьдьОповещения.ПараметрОтслеживания2 = СсылкаЗаказ.абс_Неотгружено.Итог("Количество");
				ОчерьдьОповещения.ПараметрОтслеживания3 = СсылкаЗаказ.Товары.Итог("Сумма");
				ОчерьдьОповещения.ДатаИзмененияОбъекта = ТекущаяДата() ;
				ОчерьдьОповещения.Записать();
			КонецЕсли;
		КонецЕсли;

	Иначе
		Если ОчерьдьОповещения.ПараметрОтслеживания2 <> СсылкаЗаказ.абс_Неотгружено.Итог("Количество")Тогда

				ОчерьдьОповещения.Объект = СсылкаЗаказ;
				ОчерьдьОповещения.ТипОповещения = Перечисления.абс_ТипыОповещений.РассылкаНеотгруженныйТовар;
				ОчерьдьОповещения.ОповещениеОтправлено = Ложь;
				ОчерьдьОповещения.ПараметрОтслеживания1 = СсылкаЗаказ.Товары.Итог("Количество");
				ОчерьдьОповещения.ПараметрОтслеживания2 = СсылкаЗаказ.абс_Неотгружено.Итог("Количество");
				ОчерьдьОповещения.ПараметрОтслеживания3 = СсылкаЗаказ.Товары.Итог("Сумма");
				ОчерьдьОповещения.ДатаИзмененияОбъекта = ТекущаяДата() ;
				ОчерьдьОповещения.Записать();
		КонецЕсли;
	КонецЕсли	
			
КонецПроцедуры

Процедура ОбработатьОчередьОповещения ()Экспорт
	
	ОчерьдьОповещения = РегистрыСведений.Лео_ОчередьПочтовогоОповещенияПриИзменениОбъекта;
	НаборОчерьдьОповещения = ОчерьдьОповещения.СоздатьНаборЗаписей();
	НаборОчерьдьОповещения.Отбор.ОповещениеОтправлено.Установить( Ложь);
	НаборОчерьдьОповещения.Отбор.ТипОповещения.Установить(Перечисления.абс_ТипыОповещений.РассылкаИзменениеЗаказа);
  	НаборОчерьдьОповещения.Прочитать();
	
	ТаблицаЗаписей = НаборОчерьдьОповещения.Выгрузить();
	НаборОчерьдьОповещения.Очистить();
	НаборОчерьдьОповещения.Записать();

	
	Для каждого ЗаписьОповещения из ТаблицаЗаписей Цикл
		Если  ТипЗнч(ЗаписьОповещения.Объект) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			
			ЗаписьОповещения.ОповещениеОтправлено = ОтправитьОповещениеПоЗаказу(ЗаписьОповещения.Объект,"","","",ЗаписьОповещения.ДатаИзмененияОбъекта);
			//ЗаписьОповещения.ОповещениеОтправлено = Истина;
			
			ОчерьдьОповещения = РегистрыСведений.Лео_ОчередьПочтовогоОповещенияПриИзменениОбъекта.СоздатьМенеджерЗаписи();
			ОчерьдьОповещения.Объект					= ЗаписьОповещения.Объект;
			ОчерьдьОповещения.ТипОповещения             = Перечисления.абс_ТипыОповещений.РассылкаИзменениеЗаказа;
			ОчерьдьОповещения.ДатаИзмененияОбъекта 		= ЗаписьОповещения.ДатаИзмененияОбъекта;
			ОчерьдьОповещения.ДатаОтправкиОповещения	= ЗаписьОповещения.ДатаОтправкиОповещения;
			ОчерьдьОповещения.ДопАдресОповещения 		= ЗаписьОповещения.ДопАдресОповещения;
			ОчерьдьОповещения.ОповещениеОтправлено 		= ЗаписьОповещения.ОповещениеОтправлено;
			ОчерьдьОповещения.ПараметрОтслеживания1 	= ЗаписьОповещения.ПараметрОтслеживания1;
			ОчерьдьОповещения.ПараметрОтслеживания2 	= ЗаписьОповещения.ПараметрОтслеживания2;
			ОчерьдьОповещения.ПараметрОтслеживания3		= ЗаписьОповещения.ПараметрОтслеживания3;
			ОчерьдьОповещения.ПараметрОтслеживания4 	= ЗаписьОповещения.ПараметрОтслеживания4;
            ОчерьдьОповещения.ПараметрОтслеживания5 	= ЗаписьОповещения.ПараметрОтслеживания5;
			ОчерьдьОповещения.ТекстСообщения            = ЗаписьОповещения.ТекстСообщения;
			ОчерьдьОповещения.ТемаСообщения             = ЗаписьОповещения.ТемаСообщения;

			ОчерьдьОповещения.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработатьОчередьОповещенияПоНеотгруженным ()Экспорт
	
	ОчерьдьОповещения = РегистрыСведений.Лео_ОчередьПочтовогоОповещенияПриИзменениОбъекта;
	НаборОчерьдьОповещения = ОчерьдьОповещения.СоздатьНаборЗаписей();
	НаборОчерьдьОповещения.Отбор.ОповещениеОтправлено.Установить( Ложь);
	НаборОчерьдьОповещения.Отбор.ТипОповещения.Установить(Перечисления.абс_ТипыОповещений.РассылкаНеотгруженныйТовар);
  	НаборОчерьдьОповещения.Прочитать();
	
	ТаблицаЗаписей = НаборОчерьдьОповещения.Выгрузить();
	НаборОчерьдьОповещения.Очистить();
	НаборОчерьдьОповещения.Записать();

	
	Для каждого ЗаписьОповещения из ТаблицаЗаписей Цикл
		Если  ТипЗнч(ЗаписьОповещения.Объект) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			
			ЗаписьОповещения.ОповещениеОтправлено = ОтправитьОповещениеПонеотгруженнымТоварам(ЗаписьОповещения.Объект,"","","",ЗаписьОповещения.ДатаИзмененияОбъекта);
			
			ОчерьдьОповещения = РегистрыСведений.Лео_ОчередьПочтовогоОповещенияПриИзменениОбъекта.СоздатьМенеджерЗаписи();
			ОчерьдьОповещения.Объект					= ЗаписьОповещения.Объект;
			ОчерьдьОповещения.ТипОповещения             = Перечисления.абс_ТипыОповещений.РассылкаНеотгруженныйТовар;
			ОчерьдьОповещения.ДатаИзмененияОбъекта 		= ЗаписьОповещения.ДатаИзмененияОбъекта;
			ОчерьдьОповещения.ДатаОтправкиОповещения	= ЗаписьОповещения.ДатаОтправкиОповещения;
			ОчерьдьОповещения.ДопАдресОповещения 		= ЗаписьОповещения.ДопАдресОповещения;
			ОчерьдьОповещения.ОповещениеОтправлено 		= ЗаписьОповещения.ОповещениеОтправлено;
			ОчерьдьОповещения.ПараметрОтслеживания1 	= ЗаписьОповещения.ПараметрОтслеживания1;
			ОчерьдьОповещения.ПараметрОтслеживания2 	= ЗаписьОповещения.ПараметрОтслеживания2;
			ОчерьдьОповещения.ПараметрОтслеживания3		= ЗаписьОповещения.ПараметрОтслеживания3;
			ОчерьдьОповещения.ПараметрОтслеживания4 	= ЗаписьОповещения.ПараметрОтслеживания4;
            ОчерьдьОповещения.ПараметрОтслеживания5 	= ЗаписьОповещения.ПараметрОтслеживания5;
			ОчерьдьОповещения.ТекстСообщения            = ЗаписьОповещения.ТекстСообщения;
			ОчерьдьОповещения.ТемаСообщения             = ЗаписьОповещения.ТемаСообщения;

			ОчерьдьОповещения.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ОтправитьОповещениеПоЗаказу(СсылкаЗаказ,ДопАдресОповещения,ТекстСообщения,ТемаСообщения,ДатаИзмененияОбъекта) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_НастройкиОповещения.ТипОповещения,
	|	абс_НастройкиОповещения.Действует,
	|	абс_НастройкиОповещения.АдресЭлектроннойПочты
	|ИЗ
	|	РегистрСведений.абс_НастройкиОповещения КАК абс_НастройкиОповещения
	|ГДЕ
	|	абс_НастройкиОповещения.Действует
	|	И абс_НастройкиОповещения.ТипОповещения = ЗНАЧЕНИЕ(Перечисление.абс_ТипыОповещений.РассылкаИзменениеЗаказа)
	|	И НЕ (ВЫРАЗИТЬ(абс_НастройкиОповещения.АдресЭлектроннойПочты КАК СТРОКА(100))) = """"";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
		
	ТекстЛога = ЛогированиеФайлЛога ();
	ТекстСтроки = " ----------------------------------------------------------------------------------------------------------------------------------------------------------------- " + Символы.ПС ;
	ТекстЛога.Записать(ТекстСтроки);

	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	МассивАдресов = РазобратьСтрокуВМассивПоРазделителю(Выборка.АдресЭлектроннойПочты, ",");
	Если ДопАдресОповещения <> "" Тогда
		МассивАдресов.Добавить(ДопАдресОповещения)
	КонецЕсли;
	Контрагент = СсылкаЗаказ.Контрагент;
	
	Если ЗначениеЗаполнено(Контрагент.абс_Отдел) Тогда
		Менеджер = Контрагент.абс_Отдел.абс_Менеджер;
		Если ЗначениеЗаполнено(Менеджер) Тогда
			АдресМенеджераСтр = абс_УправлениеДебиторскойЗадолженностью.ПолучитьКонтактнуюИнформацию(Менеджер, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя);
			МассивАдресовВрем = абс_УправлениеДебиторскойЗадолженностью.РазобратьСтрокуВМассивПоРазделителю(АдресМенеджераСтр, ",");
			Для каждого АдресМенеджера из МассивАдресовВрем Цикл
				Если МассивАдресов.Найти(АдресМенеджера) = Неопределено Тогда
					МассивАдресов.Добавить(АдресМенеджера);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Контрагент.абс_БизнесРегион) Тогда
		Менеджер = Контрагент.абс_БизнесРегион.абс_Менеджер;
		Если ЗначениеЗаполнено(Менеджер) Тогда
			АдресМенеджераСтр = абс_УправлениеДебиторскойЗадолженностью.ПолучитьКонтактнуюИнформацию(Менеджер, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя);
			МассивАдресовВрем = абс_УправлениеДебиторскойЗадолженностью.РазобратьСтрокуВМассивПоРазделителю(АдресМенеджераСтр, ",");
			Для каждого АдресМенеджера из МассивАдресовВрем Цикл
				Если МассивАдресов.Найти(АдресМенеджера) = Неопределено Тогда
					МассивАдресов.Добавить(АдресМенеджера);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Контрагент.абс_Территория) Тогда
		Менеджер = Контрагент.абс_Территория.абс_Менеджер;
		Если ЗначениеЗаполнено(Менеджер) Тогда
			АдресМенеджераСтр = абс_УправлениеДебиторскойЗадолженностью.ПолучитьКонтактнуюИнформацию(Менеджер, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя);
			МассивАдресовВрем = абс_УправлениеДебиторскойЗадолженностью.РазобратьСтрокуВМассивПоРазделителю(АдресМенеджераСтр, ",");
			Для каждого АдресМенеджера из МассивАдресовВрем Цикл
				Если МассивАдресов.Найти(АдресМенеджера) = Неопределено Тогда
					МассивАдресов.Добавить(АдресМенеджера);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	
	ТекстСтроки = "массив адресов для рассылки сформирован сформирован " + Формат(ТекущаяДата());
	ТекстЛога.Записать(ТекстСтроки);	
	
	ТекстПисьма = "Оповещение: Заказ покупателя "  + СсылкаЗаказ.Контрагент.НаименованиеПолное + " " + СсылкаЗаказ.Номер + " от " + Формат(СсылкаЗаказ.дата,"ДЛФ=D") + " на сумму " + СсылкаЗаказ.СуммаДокумента + " рублей с НДС (" + СсылкаЗаказ.абс_СуммаБезНДС + " рублей без НДС). " + Символы.ПС + "Последнее изменение от: " + ДатаИзмененияОбъекта ;
	
	ТемаПисьма =  "Оповещение о Заказе " + СсылкаЗаказ.Контрагент + " №" + СсылкаЗаказ.Номер + " от " + Формат(СсылкаЗаказ.дата,"ДЛФ=D") + " на сумму " + СсылкаЗаказ.абс_СуммаБезНДС + " рублей без НДС" ;
	
	//отправка
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.УведомленияДистрибуции);
	СтруктураПараметров.Вставить("Тема", ТемаПисьма);
	СтруктураПараметров.Вставить("Тело", ТекстПисьма);
	СписокКому = Новый СписокЗначений;
	СписокКому.ЗагрузитьЗначения(МассивАдресов);
	СтруктураПараметров.Вставить("Кому",СписокКому);
	
	МассивФайлов = Новый Массив;
    СформироватьФайлыОповещения(МассивФайлов,СсылкаЗаказ,ТекстЛога);
	
	
	Если МассивФайлов.Количество()>0 Тогда
		
		СписокФайловВложений = Новый СписокЗначений;
		
		Для каждого Файл из МассивФайлов Цикл
			ИмяФайла = РаботаСФайлами.ПолучитьИмяФайлаИзПолногоПути(Файл);
			
			ФайлВложения = СписокФайловВложений.Добавить();
			
			СтруктураВложения  = Новый Структура();
			
			ДвоичныеДанныеФайла = Новый ДвоичныеДанные(Файл);
			СтруктураВложения.Вставить("Хранилище", ДвоичныеДанныеФайла);
			
			СтруктураВложения.Вставить("ИмяФайла", ИмяФайла);
			
			ФайлВложения.Значение = СтруктураВложения;
		КонецЦикла;
		
		СтруктураПараметров.Вставить("СписокФайловВложений", СписокФайловВложений);
	КонецЕсли;
	
	СтруктураПисьма = УправлениеЭлектроннойПочтой.НаписатьПисьмо(глЗначениеПеременной("глТекущийПользователь"),СтруктураПараметров,,,,,, Истина, Ложь);
	
	ЭлектронныеПисьма = Новый Соответствие;
	
	ЭлектронныеПисьма.Вставить(СтруктураПисьма.ПисьмоСсылка);
	
	ИзмененныйСоставПисем = Новый Соответствие;	
	ТекущийПользователь= глЗначениеПеременной("глТекущийПользователь");	
	ДоступныеУчетныеЗаписи = УправлениеЭлектроннойПочтой.ПолучитьДоступныеУчетныеЗаписи(ТекущийПользователь);
	
	ТекстСтроки = "Формирование письма " + Формат(ТекущаяДата())+ Символы.ПС;
	ТекстЛога.Записать(ТекстСтроки);	
		
	Для каждого Письмо Из ЭлектронныеПисьма Цикл
		Если ТипЗнч(Письмо.Значение) <> Тип("ДокументОбъект.ЭлектронноеПисьмо") Тогда
			ОбъектПисьмо = Письмо.Ключ.ПолучитьОбъект();
			
			ОбъектПисьмо.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
			Если НЕ ЗначениеЗаполнено(ОбъектПисьмо.Ответственный) Тогда
				ОбъектПисьмо.Ответственный = ТекущийПользователь;
			КонецЕсли; 
			
			Попытка
				ОбъектПисьмо.Записать();
				ТекстСтроки = "письмо записано " + Формат(ТекущаяДата())+ Символы.ПС;
				ТекстЛога.Записать(ТекстСтроки);
			Исключение
				ТекстСтроки = "письмо не записано " + Формат(ТекущаяДата())+ Символы.ПС;
				ТекстЛога.Записать(ТекстСтроки);
				Продолжить;
			КонецПопытки;
		Иначе
			Письмо.Значение.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
			Если НЕ ЗначениеЗаполнено(Письмо.Значение.Ответственный) Тогда
				Письмо.Значение.Ответственный = ТекущийПользователь;
			КонецЕсли; 
		КонецЕсли; 
		ИзмененныйСоставПисем.Вставить(Письмо.Ключ, Письмо.Значение);  		
	КонецЦикла;
	
		ТекстСтроки = "попытка отправки письма " + Формат(ТекущаяДата())+ Символы.ПС;
		ТекстЛога.Записать(ТекстСтроки);	
	
	УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисем(глЗначениеПеременной("глСоответствиеТекстовЭлектронныхПисем"), ПараметрыСеанса.ТекущийПользователь,,
	ИзмененныйСоставПисем, Истина , , Ложь, );
	
	ТекстСтроки = "письмо должно было уйти, а там хз... " + Формат(ТекущаяДата())+ Символы.ПС;
	ТекстЛога.Записать(ТекстСтроки);
	
	Возврат Истина
КонецФункции

Функция ОтправитьОповещениеПоНеотгруженнымТоварам(СсылкаЗаказ,ДопАдресОповещения,ТекстСообщения,ТемаСообщения,ДатаИзмененияОбъекта) 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_НастройкиОповещения.ТипОповещения,
	|	абс_НастройкиОповещения.Действует,
	|	абс_НастройкиОповещения.АдресЭлектроннойПочты
	|ИЗ
	|	РегистрСведений.абс_НастройкиОповещения КАК абс_НастройкиОповещения
	|ГДЕ
	|	абс_НастройкиОповещения.Действует
	|	И абс_НастройкиОповещения.ТипОповещения = ЗНАЧЕНИЕ(Перечисление.абс_ТипыОповещений.РассылкаНеотгруженныйТовар)
	|	И НЕ (ВЫРАЗИТЬ(абс_НастройкиОповещения.АдресЭлектроннойПочты КАК СТРОКА(100))) = """"";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
		
	ТекстЛога = ЛогированиеФайлЛога ();
	ТекстСтроки = " ----------------------------------------------------------------------------------------------------------------------------------------------------------------- " + Символы.ПС ;
	ТекстЛога.Записать(ТекстСтроки);

	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	МассивАдресов = РазобратьСтрокуВМассивПоРазделителю(Выборка.АдресЭлектроннойПочты, ",");
	Если ДопАдресОповещения <> "" Тогда
		МассивАдресов.Добавить(ДопАдресОповещения)
	КонецЕсли;
	
	//+Адреса ответственных менеджеров	
	Контрагент = СсылкаЗаказ.Контрагент;
	
	Если ЗначениеЗаполнено(Контрагент.абс_Отдел) Тогда
		Менеджер = Контрагент.абс_Отдел.абс_Менеджер;
		Если ЗначениеЗаполнено(Менеджер) Тогда
			АдресМенеджераСтр = абс_УправлениеДебиторскойЗадолженностью.ПолучитьКонтактнуюИнформацию(Менеджер, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя);
			МассивАдресовВрем = абс_УправлениеДебиторскойЗадолженностью.РазобратьСтрокуВМассивПоРазделителю(АдресМенеджераСтр, ",");
			Для каждого АдресМенеджера из МассивАдресовВрем Цикл
				Если МассивАдресов.Найти(АдресМенеджера) = Неопределено Тогда
					МассивАдресов.Добавить(АдресМенеджера);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Контрагент.абс_БизнесРегион) Тогда
		Менеджер = Контрагент.абс_БизнесРегион.абс_Менеджер;
		Если ЗначениеЗаполнено(Менеджер) Тогда
			АдресМенеджераСтр = абс_УправлениеДебиторскойЗадолженностью.ПолучитьКонтактнуюИнформацию(Менеджер, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя);
			МассивАдресовВрем = абс_УправлениеДебиторскойЗадолженностью.РазобратьСтрокуВМассивПоРазделителю(АдресМенеджераСтр, ",");
			Для каждого АдресМенеджера из МассивАдресовВрем Цикл
				Если МассивАдресов.Найти(АдресМенеджера) = Неопределено Тогда
					МассивАдресов.Добавить(АдресМенеджера);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Контрагент.абс_Территория) Тогда
		Менеджер = Контрагент.абс_Территория.абс_Менеджер;
		Если ЗначениеЗаполнено(Менеджер) Тогда
			АдресМенеджераСтр = абс_УправлениеДебиторскойЗадолженностью.ПолучитьКонтактнуюИнформацию(Менеджер, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя);
			МассивАдресовВрем = абс_УправлениеДебиторскойЗадолженностью.РазобратьСтрокуВМассивПоРазделителю(АдресМенеджераСтр, ",");
			Для каждого АдресМенеджера из МассивАдресовВрем Цикл
				Если МассивАдресов.Найти(АдресМенеджера) = Неопределено Тогда
					МассивАдресов.Добавить(АдресМенеджера);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	//-Адреса ответственных менеджеров
	
	ТекстСтроки = "массив адресов для рассылки сформирован сформирован " + Формат(ТекущаяДата());
	ТекстЛога.Записать(ТекстСтроки);	
	
	ТекстПисьма = "Оповещение о неотгруженном товаре: Заказ покупателя "  + СсылкаЗаказ.Контрагент + " " + СсылкаЗаказ.Номер + " от " + Формат(СсылкаЗаказ.дата,"ДЛФ=D") + ". " + Символы.ПС + "Последнее изменение от: " + ДатаИзмененияОбъекта ;
	
	ТемаПисьма =  "Оповещение о неотгруженном товаре: Заказ  " + СсылкаЗаказ.Контрагент + " № " + СсылкаЗаказ.Номер + " от " + Формат(СсылкаЗаказ.дата,"ДЛФ=D") ;
	
	//отправка
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.УведомленияДистрибуции);
	СтруктураПараметров.Вставить("Тема", ТемаПисьма);
	СтруктураПараметров.Вставить("Тело", ТекстПисьма);
	СписокКому = Новый СписокЗначений;
	СписокКому.ЗагрузитьЗначения(МассивАдресов);
	СтруктураПараметров.Вставить("Кому",СписокКому);
	
	МассивФайлов = Новый Массив;
    СформироватьФайлыОповещения(МассивФайлов,СсылкаЗаказ,ТекстЛога);
	
	
	Если МассивФайлов.Количество()>0 Тогда
		
		СписокФайловВложений = Новый СписокЗначений;
		
		Для каждого Файл из МассивФайлов Цикл
			ИмяФайла = РаботаСФайлами.ПолучитьИмяФайлаИзПолногоПути(Файл);
			
			ФайлВложения = СписокФайловВложений.Добавить();
			
			СтруктураВложения  = Новый Структура();
			
			ДвоичныеДанныеФайла = Новый ДвоичныеДанные(Файл);
			СтруктураВложения.Вставить("Хранилище", ДвоичныеДанныеФайла);
			
			СтруктураВложения.Вставить("ИмяФайла", ИмяФайла);
			
			ФайлВложения.Значение = СтруктураВложения;
		КонецЦикла;
		
		СтруктураПараметров.Вставить("СписокФайловВложений", СписокФайловВложений);
	КонецЕсли;
	
	СтруктураПисьма = УправлениеЭлектроннойПочтой.НаписатьПисьмо(глЗначениеПеременной("глТекущийПользователь"),СтруктураПараметров,,,,,, Истина, Ложь);
	
	ЭлектронныеПисьма = Новый Соответствие;
	
	ЭлектронныеПисьма.Вставить(СтруктураПисьма.ПисьмоСсылка);
	
	ИзмененныйСоставПисем = Новый Соответствие;	
	ТекущийПользователь= глЗначениеПеременной("глТекущийПользователь");	
	ДоступныеУчетныеЗаписи = УправлениеЭлектроннойПочтой.ПолучитьДоступныеУчетныеЗаписи(ТекущийПользователь);
	
	ТекстСтроки = "Формирование письма " + Формат(ТекущаяДата())+ Символы.ПС;
	ТекстЛога.Записать(ТекстСтроки);	
		
	Для каждого Письмо Из ЭлектронныеПисьма Цикл
		Если ТипЗнч(Письмо.Значение) <> Тип("ДокументОбъект.ЭлектронноеПисьмо") Тогда
			ОбъектПисьмо = Письмо.Ключ.ПолучитьОбъект();
			
			ОбъектПисьмо.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
			Если НЕ ЗначениеЗаполнено(ОбъектПисьмо.Ответственный) Тогда
				ОбъектПисьмо.Ответственный = ТекущийПользователь;
			КонецЕсли; 
			
			Попытка
				ОбъектПисьмо.Записать();
				ТекстСтроки = "письмо записано " + Формат(ТекущаяДата())+ Символы.ПС;
				ТекстЛога.Записать(ТекстСтроки);
			Исключение
				ТекстСтроки = "письмо не записано " + Формат(ТекущаяДата())+ Символы.ПС;
				ТекстЛога.Записать(ТекстСтроки);
				Продолжить;
			КонецПопытки;
		Иначе
			Письмо.Значение.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее;
			Если НЕ ЗначениеЗаполнено(Письмо.Значение.Ответственный) Тогда
				Письмо.Значение.Ответственный = ТекущийПользователь;
			КонецЕсли; 
		КонецЕсли; 
		ИзмененныйСоставПисем.Вставить(Письмо.Ключ, Письмо.Значение);  		
	КонецЦикла;
	
		ТекстСтроки = "попытка отправки письма " + Формат(ТекущаяДата())+ Символы.ПС;
		ТекстЛога.Записать(ТекстСтроки);	
	
	УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисем(глЗначениеПеременной("глСоответствиеТекстовЭлектронныхПисем"), ПараметрыСеанса.ТекущийПользователь,,
	ИзмененныйСоставПисем, Истина , , Ложь, );
	
	ТекстСтроки = "письмо должно было уйти, а там хз... " + Формат(ТекущаяДата())+ Символы.ПС;
	ТекстЛога.Записать(ТекстСтроки);
	
	Возврат Истина
КонецФункции

Функция СформироватьТабДокОповещенияПоЗаказу(ЗаказСсылка,ТекстЛога) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателяТовары.Номенклатура.Артикул КАК Артикул,
		|	ВЫРАЗИТЬ(ЗаказПокупателяТовары.Номенклатура.Наименование КАК СТРОКА(300)) КАК Номенклатура,
		|	СУММА(ЗаказПокупателяТовары.Количество) КАК Количество,
		|	ЗаказПокупателяТовары.ЕдиницаИзмерения КАК ЕдИзм,
		|	ЗаказПокупателяТовары.Цена,
		|	ЗаказПокупателяТовары.Сумма / ЗаказПокупателяТовары.Количество КАК ЦенаСоСкидкой,
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказПокупателяТовары.Ссылка.СуммаВключаетНДС
		|				ТОГДА ЗаказПокупателяТовары.Сумма
		|			ИНАЧЕ ЗаказПокупателяТовары.Сумма + ЗаказПокупателяТовары.СуммаНДС
		|		КОНЕЦ) КАК СуммаСНДС,
		|	СУММА(ЗаказПокупателяТовары.СуммаНДС) КАК СуммаНДС,
		|	ЗаказПокупателяТовары.СтавкаНДС КАК НДС,
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказПокупателяТовары.Ссылка.СуммаВключаетНДС
		|				ТОГДА ЗаказПокупателяТовары.Сумма - ЗаказПокупателяТовары.СуммаНДС
		|			ИНАЧЕ ЗаказПокупателяТовары.Сумма
		|		КОНЕЦ) КАК Сумма,
		|	ЗаказПокупателяТовары.Ссылка.ВалютаДокумента КАК Валюта
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|ГДЕ
		|	ЗаказПокупателяТовары.Ссылка = &СсылкаЗаказ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателяТовары.ЕдиницаИзмерения,
		|	ЗаказПокупателяТовары.Цена,
		|	ЗаказПокупателяТовары.Сумма / ЗаказПокупателяТовары.Количество,
		|	ЗаказПокупателяТовары.СтавкаНДС,
		|	ЗаказПокупателяТовары.Ссылка.ВалютаДокумента,
		|	ЗаказПокупателяТовары.Номенклатура.Артикул,
		|	ВЫРАЗИТЬ(ЗаказПокупателяТовары.Номенклатура.Наименование КАК СТРОКА(300))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателяабс_Неотгружено.Номенклатура.Артикул КАК Артикул,
		|	ВЫРАЗИТЬ(ЗаказПокупателяабс_Неотгружено.Номенклатура.Наименование КАК СТРОКА(300)) КАК Номенклатура,
		|	СУММА(ЗаказПокупателяабс_Неотгружено.Количество) КАК Количество,
		|	ЗаказПокупателяабс_Неотгружено.ЕдиницаИзмерения КАК ЕдИзм,
		|	МАКСИМУМ(ЗаказПокупателяабс_Неотгружено.Цена) КАК Цена,
		|	МАКСИМУМ(ЗаказПокупателяабс_Неотгружено.Цена) КАК ЦенаСоСкидкой,
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказПокупателяабс_Неотгружено.Ссылка.СуммаВключаетНДС
		|				ТОГДА ЗаказПокупателяабс_Неотгружено.Сумма - ЗаказПокупателяабс_Неотгружено.СуммаНДС
		|			ИНАЧЕ ЗаказПокупателяабс_Неотгружено.Сумма
		|		КОНЕЦ) КАК Сумма,
		|	ЗаказПокупателяабс_Неотгружено.Ссылка.ВалютаДокумента КАК Валюта,
		|	СУММА(ЗаказПокупателяабс_Неотгружено.СуммаНДС) КАК СуммаНДС,
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказПокупателяабс_Неотгружено.Ссылка.СуммаВключаетНДС
		|				ТОГДА ЗаказПокупателяабс_Неотгружено.Сумма
		|			ИНАЧЕ ЗаказПокупателяабс_Неотгружено.Сумма + ЗаказПокупателяабс_Неотгружено.СуммаНДС
		|		КОНЕЦ) КАК СуммаСНДС,
		|	ЗаказПокупателяабс_Неотгружено.СтавкаНДС КАК НДС
		|ИЗ
		|	Документ.ЗаказПокупателя.абс_Неотгружено КАК ЗаказПокупателяабс_Неотгружено
		|ГДЕ
		|	ЗаказПокупателяабс_Неотгружено.Ссылка = &СсылкаЗаказ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателяабс_Неотгружено.Номенклатура.Артикул,
		|	ЗаказПокупателяабс_Неотгружено.ЕдиницаИзмерения,
		|	ЗаказПокупателяабс_Неотгружено.Ссылка.ВалютаДокумента,
		|	ВЫРАЗИТЬ(ЗаказПокупателяабс_Неотгружено.Номенклатура.Наименование КАК СТРОКА(300)),
		|	ЗаказПокупателяабс_Неотгружено.СтавкаНДС";
		
	Запрос.УстановитьПараметр("СсылкаЗаказ",ЗаказСсылка);	
	МассивРезультатов = Запрос.ВыполнитьПакет();

	ТабДок = Неопределено;
	

	Макет = ПолучитьОбщийМакет("Лео_ОповещениеПоЗаказуПокупателя");
	ТабДок = Новый ТабличныйДокумент;
	
	ОбластьШапка 			= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаТовары 	= Макет.ПолучитьОбласть("СтрокаТовары");
    ОбластьПодвалТовары		= Макет.ПолучитьОбласть("ПодвалТовары");
	ОбластьШапкаНеотгружено = Макет.ПолучитьОбласть("ШапкаНеотгружено");
	ОбластьСтрокаНеотгружено = Макет.ПолучитьОбласть("СтрокаНеотгружено");
    ОбластьПодвалНеотгружено = Макет.ПолучитьОбласть("ПодвалНеотгружено");
	
	//Шапка+
	ОбластьШапка.Параметры.ПОСТАВЩИК = ЗаказСсылка.Организация;
	ОбластьШапка.Параметры.ПОКУПАТЕЛЬ = ЗаказСсылка.Контрагент.НаименованиеПолное;
	ОбластьШапка.Параметры.Договор = ЗаказСсылка.ДоговорКонтрагента;
	ОбластьШапка.Параметры.Склад = ЗаказСсылка.СкладГруппа;
	
	ОбластьШапка.Параметры.НомерЗаказа = ЗаказСсылка.Номер;
	ОбластьШапка.Параметры.ДатаЗаказа = ЗаказСсылка.Дата;
	
	ОбластьШапка.Параметры.НомерЗаказаПокупателя = ЗаказСсылка.НомерПоДаннымПокупателя;
	ОбластьШапка.Параметры.ДатаЗаказаПокупателя = Формат(ЗаказСсылка.ДатаПоДаннымПокупателя,"ДЛФ=D");

    ОбластьШапка.Параметры.Грузополучатель = ЗаказСсылка.Грузополучатель.НаименованиеПолное;
    ОбластьШапка.Параметры.АдресДоставки = ЗаказСсылка.АдресДоставки;
	
	Если ЗаказСсылка.ТипЦен.ЦенаВключаетНДС Тогда
		СтрокаНДС = "с НДС";	
	Иначе
		СтрокаНДС = "без НДС";
	КонецЕсли;
	
	ОбластьШапка.Параметры.НДС = СтрокаНДС;

    ТабДок.Вывести(ОбластьШапка);
	//Шапка-
	
	РезультатТовары = МассивРезультатов[0];
 	ВыборкаТовары = РезультатТовары.Выбрать(); 
	ПП = 1;
 	Пока ВыборкаТовары.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаТовары.Параметры, ВыборкаТовары);
		ОбластьСтрокаТовары.Параметры.ПП = ПП;
		ТабДок.Вывести(ОбластьСтрокаТовары);
		ПП = ПП +1;
	КонецЦикла;
	
	ЛеоНДСРучнойСкидки = 0;
	Для каждого СтрокаТовары из ЗаказСсылка.Товары Цикл
		Если СтрокаТовары.абс_СуммаРучнойСкидки	 > 0 Тогда
			ЛеоНДСРучнойСкидки = ЛеоНДСРучнойСкидки + УчетНДС.РассчитатьСуммуНДС(СтрокаТовары.абс_СуммаРучнойСкидки, Истина, Ложь, УчетНДС.ПолучитьСтавкуНДС(СтрокаТовары.СтавкаНДС));	
		КонецЕсли;
	КонецЦикла;

	                                                                 
	//ПодвалТовары+
	ОбластьПодвалТовары.Параметры.Количество = 	ЗаказСсылка.Товары.Итог("Количество");	 
	ОбластьПодвалТовары.Параметры.Сумма	= ЗаказСсылка.абс_СуммаБезНДС;
	ОбластьПодвалТовары.Параметры.СуммаСНДС	= ЗаказСсылка.абс_СуммаСНДС; 
	Если НЕ ЗаказСсылка.Контрагент.абс_Отдел=Справочники.Регионы.НайтиПоКоду("Б00000004") Тогда
		ОбластьПодвалТовары.Параметры.ТипЦен = ЗаказСсылка.ТипЦен;
		ОбластьПодвалТовары.Параметры.ТипЦенНаименование = "Тип цен :";
	Иначе
		ОбластьПодвалТовары.Параметры.ТипЦен = ""; 
		ОбластьПодвалТовары.Параметры.ТипЦенНаименование = "";
	КонецЕсли;
	ОбластьПодвалТовары.Параметры.ПланируемаяДатаОтгрузки  = Формат(ЗаказСсылка.ДатаОтгрузки,"ДЛФ=D");
	ОбластьПодвалТовары.Параметры.ПланируемаяДатаОплаты  = Формат(ЗаказСсылка.ДатаОплаты,"ДЛФ=D");
	ОбластьПодвалТовары.Параметры.СуммаСкидки = ЗаказСсылка.Товары.Итог("абс_СуммаРучнойСкидки");
	ОбластьПодвалТовары.Параметры.СуммаСкидкиСНДС = ЗаказСсылка.Товары.Итог("абс_СуммаРучнойСкидки")+ ЛеоНДСРучнойСкидки;
    ОбластьПодвалТовары.Параметры.ПроцентСвежести = ПолучитьПроцентСвежести(ЗаказСсылка.Контрагент);
	ОбластьПодвалТовары.Параметры.УсловияОплаты  = ПолучитьУсловияОплаты(ЗаказСсылка.ДоговорКонтрагента);
	//ОбластьПодвалТовары.Параметры.СтатусБлокировки = ПолучитьСтатусДебитора(ЗаказСсылка.Контрагент);
	ОбластьПодвалТовары.Параметры.Валюта =  ЗаказСсылка.ВалютаДокумента;
	ОбластьПодвалТовары.Параметры.Комментарий =  ЗаказСсылка.Комментарий;
	//ОбластьПодвалТовары.Параметры.ПДЗ  
    //ОбластьПодвалТовары.Параметры.ЕдИзм		
	//ОбластьПодвалТовары.Параметры.ЦенаСоСкидкой	
	
	//ОбластьПодвалТовары.Параметры.УсловияОплаты
	//ОбластьПодвалТовары.Параметры.СтатусБлокировки	
	ТабДок.Вывести(ОбластьПодвалТовары);
    //ПодвалТовары-

	РезультатНеотгружено = МассивРезультатов[1];
	
	ИтогСумма = 0;
	ИтогСуммаСНДС = 0;
	
	Если Не РезультатНеотгружено.Пустой()Тогда 
		ОбластьШапкаНеотгружено.Параметры.НДС = СтрокаНДС;
		ТабДок.Вывести(ОбластьШапкаНеотгружено);

		ВыборкаНеотгружено = РезультатНеотгружено.Выбрать(); 
		ПП = 1;
		Пока ВыборкаНеотгружено.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаНеотгружено.Параметры, ВыборкаНеотгружено);
			ОбластьСтрокаНеотгружено.Параметры.ПП = ПП;
			ТабДок.Вывести(ОбластьСтрокаНеотгружено);
			ПП = ПП +1;
			ИтогСумма = ИтогСумма + ВыборкаНеотгружено.Сумма;
	        ИтогСуммаСНДС = ИтогСуммаСНДС + ВыборкаНеотгружено.СуммаСНДС;
	
		КонецЦикла;
		//ПодвалНеотгружено+
		ОбластьПодвалНеотгружено.Параметры.Количество = 	ЗаказСсылка.абс_Неотгружено.Итог("Количество");
		ИтогСумма = ЗаказСсылка.абс_Неотгружено.Итог("Сумма");
		// {Лео Катанович
	//	ОбластьПодвалНеотгружено.Параметры.Сумма = 	ИтогСумма;
    //  ОбластьПодвалНеотгружено.Параметры.СуммаСНДС = 	ИтогСумма +  ЗаказСсылка.абс_Неотгружено.Итог("СуммаНДС");
	
    	ОбластьПодвалНеотгружено.Параметры.Сумма   = ИтогСумма;
        ОбластьПодвалНеотгружено.Параметры.СуммаСНДС = ИтогСуммаСНДС;
	  
	  // Лео Катанович}
		ТабДок.Вывести(ОбластьПодвалНеотгружено);
	 	//ПодвалНеотгружено-
	КонецЕсли;
	ТабДок.АвтоМасштаб = Истина;		
	ТекстСтроки = "Файл по документу " + ЗаказСсылка +" " + Формат(ТекущаяДата())+ Символы.ПС;
	ТекстЛога.Записать(ТекстСтроки);
	Возврат ТабДок
	
КонецФункции

Процедура СформироватьФайлыОповещения(МассивФайлов,ЗаказСсылка,ТексЛога) Экспорт
		
	ТабДок = СформироватьТабДокОповещенияПоЗаказу(ЗаказСсылка,ТексЛога);
	
	Если Не ТабДок = Неопределено Тогда
		
		ПутьКФайлу = КаталогВременныхФайлов() + "Оповещение о Заказе №" + ЗаказСсылка.Номер + " дата " +  Формат(ЗаказСсылка.Дата, "ДФ=дд.ММ.ггг") + " " + Формат(ТекущаяДата(), "ДФ=дд.ММ.ггг") + ".xls";
		
		//завершение процессов эксель
		WMI = ПолучитьCOMОбъект("winmgmts:{impersonationLevel=impersonate}!\\.\root\CIMV2");
		
		Результат = WMI.ExecQuery("Select * from Win32_Process Where Name = 'EXCEL.EXE'");
		
		Для Каждого СтрокаРез Из Результат Цикл
			
			Сообщить(СтрокаРез.name + " ID = " + СтрокаРез.ProcessID);
			
			Рез = СтрокаРез.Terminate();
			
			Если Рез = 0 Тогда
				Сообщить("Процесс завершен.");
			КонецЕсли;
			
		КонецЦикла;
		
		Попытка
			ТабДок.Записать(ПутьКФайлу ,ТипФайлаТабличногоДокумента.XLS);
			МассивФайлов.Добавить(ПутьКФайлу);
		Исключение
			Сообщить("Ошибка при создании файла Excel " + ОписаниеОшибки());
		КонецПопытки;
		
		//Попытка
		//	Excel = Новый COMОбъект("Excel.Application");
		//	Книга = Excel.WorkBooks.Open(ПутьКФайлу);
		//	ExcelЛист = Книга.Sheets(1);
		//	ExcelPS =  ExcelЛист.PageSetup;
		//	
		//	ScriptCtrl = Новый ComОбъект("MSScriptControl.ScriptControl");
		//	ScriptCtrl.Language = "vbscript";
		//	ScriptCtrl.AddCode("Function SetAutoZoom()
		//	|	ExcelPS.Zoom = False
		//	|	ExcelPS.FitToPagesWide = 1
		//	|	ExcelPS.FitToPagesTall = 10
		//	|End Function");
		//	ScriptCtrl.AddObject("ExcelPS", ExcelPS);
		//	ScriptCtrl.Run("SetAutoZoom");
		//	Книга.Save();
		//	Excel.Quit();
		//Исключение
		//	Сообщить("Ошибка при форматировании файла Excel " + ОписаниеОшибки());
		//	Excel.Quit();
		//КонецПопытки;
		
	КонецЕсли;
		
КонецПроцедуры

Функция ЛогированиеФайлЛога ();
	
	ИмяФайла = "ЛогРассылкиОповещений_" + Формат(ТекущаяДата(),"ДФ=гг_ММ_д") +".txt";
	//КаталогЛога = ЭтотОбъект.КаталогЗагрузки;
	КаталогЛога = Справочники.Лео_РабочиеКаталоги.КаталогЛогированияРассылкиОтчетаПДЗ.Каталог;
	ТекстЛога = Новый ЗаписьТекста(КаталогЛога+ИмяФайла, КодировкаТекста.UTF16,,Истина,);
	Возврат  ТекстЛога
	
КонецФункции

Функция РазобратьСтрокуВМассивПоРазделителю(Знач Стр, СтрРазделитель = ".") Экспорт
	
	Результат = Новый Массив;
	
	ВхождениеРазделителя = Найти(Стр, СтрРазделитель);
	Пока ВхождениеРазделителя <> 0 Цикл
		ЧастьДоРазделителя = СокрЛП(Лев(Стр, ВхождениеРазделителя - 1));
		Результат.Добавить(ЧастьДоРазделителя);
		Стр = СокрЛП(Сред(Стр, ВхождениеРазделителя + 1));
		ВхождениеРазделителя = Найти(Стр, СтрРазделитель);
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(Стр) Тогда
		Результат.Добавить(СокрЛП(Стр));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПроцентСвежести(Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Объект = &Контрагент
		|	И ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.абс_ПроцентСвежестиТовара)";
		
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда 
			ПроцентСвежести =  "" + Выборка.Значение +"%";
		Иначе
			ПроцентСвежести = "";
		КонецЕсли;
		
		Возврат ПроцентСвежести
КонецФункции

Функция ПолучитьУсловияОплаты(ДоговорКонтрагента) Экспорт
	
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		ТекстПредоплаты = ?(ДоговорКонтрагента.ПроцентПредоплаты = 0, "", "предоплата " + СокрЛП(ДоговорКонтрагента.ПроцентПредоплаты) + "%");
		//Если ДоговорКонтрагента.КонтролироватьЧислоДнейЗадолженности Тогда
			ТекстПостоплаты = ?(ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности=0, "", "постоплата в течение " + ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности + " дней");
		//Иначе
		//	ТекстПостоплаты = "";
		//КонецЕсли;
		//
		Если Не ТекстПредоплаты="" или Не ТекстПостоплаты="" Тогда
			ИнфНадписьУсловияОплаты = ?(ТекстПредоплаты="", "" + ТекстПостоплаты, "" + ТекстПредоплаты + " " + ТекстПостоплаты);
		Иначе
			ИнфНадписьУсловияОплаты  = "";
		КонецЕсли;
	Иначе
		ИнфНадписьУсловияОплаты = "";
	КонецЕсли;
	
	Возврат ИнфНадписьУсловияОплаты
КонецФункции

Функция  ПолучитьСтатусДебитора(Контрагент)
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		ИнфНадписьСтатусДебитора = "";
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Объект = &Контрагент
		|	И ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.лео_СтатусДебитора)";

		
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда 
			ИнфНадписьСтатусДебитора= "" + Выборка.Значение +"";

		Иначе
			ИнфНадписьСтатусДебитора = "Разблокирован";

		КонецЕсли;
	КонецЕсли;
    Возврат  ИнфНадписьСтатусДебитора;
	
КонецФункции


// Лео + ZAA

Процедура Лео_ОбновлениеДоговорИсторияРеквизитаЧислоДнейЗадолженности() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лео_ИсторияРеквизитаЧислоДнейЗадолженности.Период,
	|	Лео_ИсторияРеквизитаЧислоДнейЗадолженности.Договор,
	|	Лео_ИсторияРеквизитаЧислоДнейЗадолженности.ДопустимоеЧислоДнейЗадолженности,
	|	Лео_ИсторияРеквизитаЧислоДнейЗадолженности.ЧислоДнейПредоплаты,
	|	Лео_ИсторияРеквизитаЧислоДнейЗадолженности.Предоплата,
	|	Лео_ИсторияРеквизитаЧислоДнейЗадолженности.Ответственный
	|ИЗ
	|	РегистрСведений.Лео_ИсторияРеквизитаЧислоДнейЗадолженности КАК Лео_ИсторияРеквизитаЧислоДнейЗадолженности
	|ГДЕ
	|	Лео_ИсторияРеквизитаЧислоДнейЗадолженности.Период = &Период";
	Запрос.УстановитьПараметр("Период",НачалоДня(ТекущаяДата()));
	Рез = Запрос.Выполнить();
	
	Если НЕ Рез.Пустой() тогда
		сИстория = Рез.Выбрать();
	  Пока сИстория.Следующий() цикл
    	   Лео_ОбновитьРеквизитыСогласноЛео_ИсторияРеквизитаЧислоДнейЗадолженности(сИстория.Договор);
	  КонецЦикла;
	Конецесли;
	
	
КонецПроцедуры

Процедура Лео_ОбновитьРеквизитыСогласноЛео_ИсторияРеквизитаЧислоДнейЗадолженности(сДог)
	
	//сИстория = РегистрыСведений.Лео_ИсторияРеквизитаЧислоДнейЗадолженности.ПолучитьПоследнее(ТекущаяДата(), Новый Структура("Договор",Ссылка));
	Если сДог.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком тогда
		  возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лео_ИсторияРеквизитаЧислоДнейЗадолженности.Период,
	|	Лео_ИсторияРеквизитаЧислоДнейЗадолженности.Договор,
	|	Лео_ИсторияРеквизитаЧислоДнейЗадолженности.ДопустимоеЧислоДнейЗадолженности,
	|	Лео_ИсторияРеквизитаЧислоДнейЗадолженности.ЧислоДнейПредоплаты,
	|	Лео_ИсторияРеквизитаЧислоДнейЗадолженности.Предоплата,
	|	Лео_ИсторияРеквизитаЧислоДнейЗадолженности.Ответственный
	|ИЗ
	|	РегистрСведений.Лео_ИсторияРеквизитаЧислоДнейЗадолженности КАК Лео_ИсторияРеквизитаЧислоДнейЗадолженности
	|ГДЕ
	|	Лео_ИсторияРеквизитаЧислоДнейЗадолженности.Договор = &Договор
	|	И Лео_ИсторияРеквизитаЧислоДнейЗадолженности.Период = &Период";
	Запрос.УстановитьПараметр("Договор",сДог);
	Запрос.УстановитьПараметр("Период",НачалоДня(ТекущаяДата()));
	Рез = Запрос.Выполнить();
	
			мПроцентПредоплаты                = Ложь;
			мЛео_ЧислоДнейПредоплаты          = Ложь;
			мДопустимоеЧислоДнейЗадолженности = Ложь;
			
	
	Если НЕ Рез.Пустой() тогда
		сИстория = Рез.Выбрать();
		сИстория.Следующий();
		Если сИстория.ДопустимоеЧислоДнейЗадолженности <> сДог.ДопустимоеЧислоДнейЗадолженности тогда
			мЧисл = СокрЛП(сДог.ДопустимоеЧислоДнейЗадолженности); 
			ДопустимоеЧислоДнейЗадолженности = сИстория.ДопустимоеЧислоДнейЗадолженности;
			мДопустимоеЧислоДнейЗадолженности = Истина;
		КонецЕсли;
		
		Если сИстория.ЧислоДнейПредоплаты <> сДог.Лео_ЧислоДнейПредоплаты тогда
			мЧисл = СокрЛП(сДог.Лео_ЧислоДнейПредоплаты); 
			Лео_ЧислоДнейПредоплаты = сИстория.ЧислоДнейПредоплаты;
			мЛео_ЧислоДнейПредоплаты = Истина;
		КонецЕсли;
		                              
		Если сИстория.Предоплата <> сДог.ПроцентПредоплаты тогда
			мЧисл = СокрЛП(сДог.ПроцентПредоплаты); 
			ПроцентПредоплаты = сИстория.Предоплата;
			мПроцентПредоплаты = Истина;
		КонецЕсли;
		
		Если  мПроцентПредоплаты или мЛео_ЧислоДнейПредоплаты или мДопустимоеЧислоДнейЗадолженности тогда
			  дог = сДог.получитьОбъект();
			  дог.ПроцентПредоплаты                = сИстория.Предоплата;
			  дог.Лео_ЧислоДнейПредоплаты          = сИстория.ЧислоДнейПредоплаты;
			  дог.ДопустимоеЧислоДнейЗадолженности = сИстория.ДопустимоеЧислоДнейЗадолженности;
			  дог.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры	

Процедура Лео_БлокировкаЗаказаТК() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка КАК Заказ,
	|	ЗаказПокупателя.Ссылка.Дата КАК ДатаЗаказа,
	|	ЗаказПокупателя.Контрагент,
	|	абс_СпособыДоставкиКонтрагентов.Ссылка КАК абс_СпособыДоставкиКонтрагентов,
	|	абс_СпособыДоставкиКонтрагентов.СпособДоставки,
	|	абс_СпособыДоставкиКонтрагентов.ТК1,
	|	абс_СпособыДоставкиКонтрагентов.ТК1_Статус,
	|	ЕСТЬNULL(абс_СпособыДоставкиКонтрагентов.ТК1_ДатаДействияДоверенности, ДАТАВРЕМЯ(1, 1, 1)) КАК ТК1_ДатаДействияДоверенности,
	|	абс_СпособыДоставкиКонтрагентов.ТК2,
	|	абс_СпособыДоставкиКонтрагентов.ТК2_Статус,
	|	ЕСТЬNULL(абс_СпособыДоставкиКонтрагентов.ТК2_ДатаДействияДоверенности, ДАТАВРЕМЯ(1, 1, 1)) КАК ТК2_ДатаДействияДоверенности,
	|	абс_СпособыДоставкиКонтрагентов.ТК3,
	|	абс_СпособыДоставкиКонтрагентов.ТК3_Статус,
	|	ЕСТЬNULL(абс_СпособыДоставкиКонтрагентов.ТК3_ДатаДействияДоверенности, ДАТАВРЕМЯ(1, 1, 1)) КАК ТК3_ДатаДействияДоверенности
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.абс_СпособыДоставкиКонтрагентов КАК абс_СпособыДоставкиКонтрагентов
	|		ПО ЗаказПокупателя.Контрагент = абс_СпособыДоставкиКонтрагентов.Владелец
	|			И ЗаказПокупателя.Контрагент.абс_ОсновнойСпособДоставки = абс_СпособыДоставкиКонтрагентов.Ссылка
	|ГДЕ
	//|	ЗаказПокупателя.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	ЗаказПокупателя.Ссылка = &ЗаказПокупателя
	
	|";
	
	Запрос.УстановитьПараметр("ДатаНач", ТекущаяДата() - (86400 * 15));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ТекущаяДата()));
	//Запрос.УстановитьПараметр("ЗаказПокупателя", ЭтотОбъект.ЗаказПокупателя);
	
	Результат = Запрос.Выполнить();
	ТЗ = Результат.Выгрузить();
	
	Для каждого стр из ТЗ цикл
		
		_Блокировать = Ложь;
		_Комментарий = "";
		
		//3. Условия блокировки Заказа: наступление хотя бы одного из событий:
		//3а) выбран один из двух Способов доставки «Доставка до ТК в городе грузополучателя» или «Доставка до ТК клиента», 
		//но при этом не заполнено поле «Наименование ТК» в соответствующей строке из трёх «Транспортная компания …» 		
		Если (стр.СпособДоставки = Перечисления.абс_ВидыСпособовДоставки.ДоставкаДоТК или
			стр.СпособДоставки = Перечисления.абс_ВидыСпособовДоставки.ДоставкаДоТККлиента) И
			(НЕ ЗначениеЗаполнено(стр.ТК1)и НЕ ЗначениеЗаполнено(стр.ТК2)и НЕ ЗначениеЗаполнено(стр.ТК3))
			тогда 
			_Блокировать = Истина;	
			
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("++++++++++++++++++++++++++++");
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СокрЛП(стр.Заказ));
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("3а) выбран один из двух Способов доставки «Доставка до ТК в городе грузополучателя» или «Доставка до ТК клиента»");
			
			_Комментарий = ", 3а)";
			
			
			//или при заполненном поле «Наименование ТК» не заполнено хотя бы одно поле из двух обязательных (при выборе ТК)
			//полей «Статус Доверенности на ТК» и/или «Дата действия Доверенности на ТК»;		 
		ИначеЕсли (ЗначениеЗаполнено(стр.ТК1)или ЗначениеЗаполнено(стр.ТК2)или  ЗначениеЗаполнено(стр.ТК3)) и
			(
			НЕ (ЗначениеЗаполнено(стр.ТК1_Статус)или ЗначениеЗаполнено(стр.ТК2_Статус)или ЗначениеЗаполнено(стр.ТК3_Статус)) и
			НЕ (ЗначениеЗаполнено(стр.ТК1_ДатаДействияДоверенности) или ЗначениеЗаполнено(стр.ТК2_ДатаДействияДоверенности)или ЗначениеЗаполнено(стр.ТК3_ДатаДействияДоверенности))	 
			) 
			тогда
			_Блокировать = Истина;	
			
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("++++++++++++++++++++++++++++");
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СокрЛП(стр.Заказ));
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("или при заполненном поле «Наименование ТК» не заполнено хотя бы одно поле из двух обязательных (при выборе ТК)");
			
			_Комментарий = ", ли при заполненном поле «Наименование ТК»";
			
			
			//3б) Текущая дата и/или дата Заказа более даты заполненной в поле «Дата действия Доверенности на ТК».	
		ИначеЕсли ((ТекущаяДата() > стр.ТК1_ДатаДействияДоверенности и ЗначениеЗаполнено(стр.ТК1_ДатаДействияДоверенности))
			или (ТекущаяДата() > стр.ТК2_ДатаДействияДоверенности и ЗначениеЗаполнено(стр.ТК2_ДатаДействияДоверенности))
			или (ТекущаяДата() > стр.ТК3_ДатаДействияДоверенности и ЗначениеЗаполнено(стр.ТК3_ДатаДействияДоверенности)))
			или 
			((стр.ДатаЗаказа > стр.ТК1_ДатаДействияДоверенности и ЗначениеЗаполнено(стр.ТК1_ДатаДействияДоверенности))
			или (стр.ДатаЗаказа > стр.ТК2_ДатаДействияДоверенности и ЗначениеЗаполнено(стр.ТК2_ДатаДействияДоверенности))
			или (стр.ДатаЗаказа > стр.ТК3_ДатаДействияДоверенности и ЗначениеЗаполнено(стр.ТК3_ДатаДействияДоверенности)))
			тогда  
			_Блокировать = Истина;	
			
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("++++++++++++++++++++++++++++");
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СокрЛП(стр.Заказ));
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("3б) Текущая дата и/или дата Заказа более даты заполненной в поле «Дата действия Доверенности на ТК»");
			
			_Комментарий = ", 3б)";
			
			
		КонецЕсли;
		
		
		
		Если _Блокировать Тогда
			ЗаказПокупателя = стр.Заказ;
			Если НеСуществуетРеализация(ЗаказПокупателя) тогда
				
				НаборЗаписей = РегистрыСведений.абс_КонтрольДЗПоЗаказам.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ЗаказПокупателя.Установить(ЗаказПокупателя);		
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Период = ТекущаяДата();
				НоваяЗапись.ЗаказПокупателя = ЗаказПокупателя;
				НоваяЗапись.СтатусДЗ=Перечисления.абс_СтатусыДЗПоЗаказам.Блокирован;
				НоваяЗапись.ПринудительнаяБлокировка = Истина;		
				НаборЗаписей.Записать();
				
				
				ЗаписьЖурналаРегистрации(
				НСтр("Лео_БлокировкаЗаказаТК"),
				УровеньЖурналаРегистрации.Информация,
				,
				,
				"3аблокирован заказ: " + СокрЛП(стр.Заказ) + _Комментарий);
				
				
				
				
				//абс_ОбменДаннымиСервер.РазблокированныеЗаблокироватьЗаказСервер(ЗаказПокупателя);
				
				//Иначе
				//	Сообщить("Данный заказ нельзя заблокировать, он содержит реализацию!");
				//	Возврат;
			КонецЕсли;	 	
		КонецЕсли;	 	
	КонецЦикла;	
	
КонецПроцедуры

Функция НеСуществуетРеализация(ЗаказПокупателя)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СвязанныеДокументы.Ссылка
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&ЗначениеКритерияОтбора) КАК СвязанныеДокументы
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(СвязанныеДокументы.Ссылка) = ТИП(Документ.РеализацияТоваровУслуг)";
	
	Запрос.УстановитьПараметр("ЗначениеКритерияОтбора", ЗаказПокупателя);
	Результат = Запрос.Выполнить();
	Возврат Результат.Пустой();
	
КонецФункции

 // Лео - ZAA





//{Катанович
Процедура РассылкаОтчетаПоЗапасам() Экспорт
//////////////////	ОтчетСсылка = Справочники.ВнешниеОбработки.НайтиПоКоду("000000499"); // Отчет по запасам
//////////////////	//ДвоичныеДанные = ОтчетСсылка.ХранилищеВнешнейОбработки.Получить();
//////////////////	//
//////////////////	//ИмяФайла = ПолучитьИмяВременногоФайла();
//////////////////	//ДвоичныеДанные.Записать(ИмяФайла);
//////////////////////////////////////////////////////	
//////////////////	
//////////////////		АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ОтчетСсылка.ХранилищеВнешнейОбработки.Получить());
//////////////////	
//////////////////	ИмяОбработки = ВнешниеОбработки.Подключить(АдресВоВременномХранилище,ОтчетСсылка.Наименование , Ложь);
//////////////////	
//////////////////	Обработка = ВнешниеОбработки.Создать(ИмяОбработки);
//////////////////	

///////////////////////////////////////////////////////////////////////////////////	
//////////////////	//Отчет = ВнешниеОтчеты.Создать(ИмяОбработки);
//////////////////	Обработка.ОтправитьОтчетПоМылу_РегламентноеЗадание();


//////////////////	УдалитьФайлы(ИмяОбработки);


    ВнешняяОбработка = Справочники.ВнешниеОбработки.НайтиПоКоду("000000499"); // Отчет по запасам
    ДвоичныеДанные = ВнешняяОбработка.ХранилищеВнешнейОбработки.Получить();
    
    ИмяВременногоФайла = ПолучитьИмяВременногоФайла("ert");
    ДвоичныеДанные.Записать(ИмяВременногоФайла);
    
    ОбработкаЗагрузки = ВнешниеОтчеты.Создать(ИмяВременногоФайла, Ложь);
	

/////////////////////////////////////////////////////////////////	
	//Отчет = ВнешниеОтчеты.Создать(ИмяОбработки);
	ОбработкаЗагрузки.ОтправитьОтчетПоМылу_РегламентноеЗадание();


    УдалитьФайлы(ИмяВременногоФайла);



КонецПроцедуры	

Процедура ОтправитьОповещениеПоПлановойСпецификации(Источник, Отказ, Замещение) Экспорт
	// Вставить содержимое обработчика.   
	
	Если НЕ Отказ Тогда  
		 Если абс_Дистрибуция.НоменклатураВходитВПапку(Источник.Отбор.Номенклатура.Значение) Тогда
		      абс_РегламентныеЗадания.Лео_ИзменениеСпецификацийИТехкарт("Плановую Спецификацию : (" + Источник.Отбор.Номенклатура.Значение.Артикул + ") " + СокрЛП(Источник.Отбор.Номенклатура.Значение));
	     КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры   

//Катанович}
